ljgabc/rtthread/bsp/n32g003/library/n32g003_tim.c
/**
*     Copyright (c) 2022, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g003_tim.c
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved.
**/
#include "n32g003_tim.h"
#include "n32g003_rcc.h"

/**
*\*\name    TIM_Reset.
*\*\fun     Reset the TIM registers.
*\*\param   TIMx :
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\return  none
**/
void TIM_Reset(TIM_Module* TIMx)
{

    if (TIMx == TIM1)
    {
        RCC_Peripheral_Reset(RCC_RST_TIM1RST);
    }
    else if (TIMx == TIM3)
    {
        RCC_Peripheral_Reset(RCC_RST_TIM3RST);
    }
    else if (TIMx == TIM6)
    {
        RCC_Peripheral_Reset(RCC_RST_TIM6RST);
    }
}

/**
*\*\name    TIM_Base_Count_Mode_Set.
*\*\fun     Initializes the TIM cnt mode in up mode or down mode.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   cnt_mode
*\*\          - TIM_CNT_MODE_UP
*\*\          - TIM_CNT_MODE_DOWN
*\*\          - TIM_CNT_MODE_CENTER_ALIGN1    TIM Center Aligned Mode1
*\*\          - TIM_CNT_MODE_CENTER_ALIGN2    TIM Center Aligned Mode2
*\*\          - TIM_CNT_MODE_CENTER_ALIGN3    TIM Center Aligned Mode3
*\*\return  none
*\*\note    The counting direction of TIM6 is fixed upward counting
**/
void TIM_Base_Count_Mode_Set(TIM_Module* TIMx, uint32_t cnt_mode)
{
    uint32_t temp_value = 0;

    temp_value = TIMx->CTRL1;
    /* Reset the CMS and DIR Bits */
    temp_value &= (uint32_t)(~((uint32_t)(TIM_CTRL1_DIR | TIM_CTRL1_CAMSEL)));
    /* Set the Counter Mode */
    temp_value |= cnt_mode;
    /* Write to TIMx CTRL1 register */
    TIMx->CTRL1 = temp_value;
}


/**
*\*\name    TIM_Base_Auto_Reload_Set.
*\*\fun     Initializes the TIM AR value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\param   auto_reload：
              - [1, 0xffff]
*\*\return  none
**/
void TIM_Base_Auto_Reload_Set(TIM_Module* TIMx, uint16_t auto_reload)
{
    TIMx->AR = auto_reload;
}

/**
*\*\name    TIM_Base_Prescaler_Set.
*\*\fun     Initializes the TIM PSC value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\param   prescaler
*\*\return  none
**/
void TIM_Base_Prescaler_Set(TIM_Module* TIMx, uint16_t prescaler)
{
    TIMx->PSC = prescaler;
}

/**
*\*\name    TIM_Base_Reload_Mode_Set.
*\*\fun     Initializes the TIM reload mode
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\param   prescaler_reload_mode:
**\           - TIM_PSC_RELOAD_MODE_IMMEDIATE
**\           - TIM_PSC_RELOAD_MODE_UPDATE
*\*\return  none
**/
void TIM_Base_Reload_Mode_Set(TIM_Module* TIMx, uint16_t prescaler_reload_mode)
{
    TIMx->EVTGEN = prescaler_reload_mode;
}

/**
*\*\name    TIM_Base_Repeat_Count_Set.
*\*\fun     Initializes the TIM repeat cnt
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   repeat_cnt
*\*\          - [0,255]
*\*\return  none
**/
void TIM_Base_Repeat_Count_Set(TIM_Module* TIMx, uint8_t repeat_cnt)
{
    TIMx->REPCNT = repeat_cnt;
}

/**
*\*\name    TIM_Base_Channel1.
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   channel_selection:
**\           - 1
**\             CH1 is from COMP
**\           - 0
**\             CH1 is from IO
*\*\return  none
*\*\note    not for TIM6
**/
void TIM_Base_Channel1(TIM_Module* TIMx, bool channel_selection)
{
    if(channel_selection)
    {
        TIMx->CTRL1 |= TIM_CH1_SEL;
    }
    else
    {
        TIMx->CTRL1 &= (uint32_t)(~TIM_CH1_SEL);
    }    
}


/**
*\*\name    TIM_Base_OCrefClear.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   OCrefClear_selection:
**\           - 1
**\             OCrefClear is from ETR
**\           - 0
**\             OCrefClear is from COMP
*\*\return  none 
*\*\note    Not for TIM6
**/
void TIM_Base_OCrefClear(TIM_Module* TIMx, bool OCrefClear_selection)
{
    if (OCrefClear_selection)
    {
        TIMx->CTRL1 |= TIM_OCREF_CLEAR_SEL;
    }
    else
    {
        TIMx->CTRL1 &= (uint32_t)(~TIM_OCREF_CLEAR_SEL);
    }
}

/**
*\*\name    TIM_Base_Init.
*\*\fun     Initializes the TIMx Time Base Unit peripheral according to
*\*\        the specified parameters in the TIM_TimeBaseInitStruct.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\param   TIM_TimeBaseInitStruct:
*\*\          - refer to the definition of TIM_TimeBaseInitType
*\*\return  none
**/
void TIM_Base_Initialize(TIM_Module* TIMx, TIM_TimeBaseInitType* TIM_TimeBaseInitStruct)
{
    if (TIMx != TIM6)
    {
        TIM_Base_Count_Mode_Set(TIMx, TIM_TimeBaseInitStruct->CntMode);
        TIM_Clock_Division_Set(TIMx, TIM_TimeBaseInitStruct->ClkDiv);
    }
    else
    {
        /* none */
    }

    TIM_Base_Auto_Reload_Set(TIMx, TIM_TimeBaseInitStruct->Period);

    TIM_Base_Prescaler_Set(TIMx, TIM_TimeBaseInitStruct->Prescaler);

    if (TIMx == TIM1)
    {
        TIM_Base_Repeat_Count_Set(TIMx,TIM_TimeBaseInitStruct->RepetCnt);
    }
    else
    {
        /* none */
    }

    TIM_Base_Reload_Mode_Set(TIMx, TIM_PSC_RELOAD_MODE_IMMEDIATE);

    if ((TIMx != TIM6))
    {
        TIM_Base_Channel1(TIMx, TIM_TimeBaseInitStruct->CapCh1Sel);
    }
    else 
    {
        /* none */
    }
    
    if ((TIMx == TIM1) || (TIMx == TIM3))
    {
        TIM_Base_OCrefClear(TIMx, TIM_TimeBaseInitStruct->CapEtrClrFromCompEn);
    }
    else 
    {
        /* none */
    }
    
