ljgabc/rtthread/bsp/n32g003/library/n32g003_tim.c
}

void TIM_Base_Struct_Initialize(TIM_TimeBaseInitType* TIM_TimeBaseInitStruct)
{
    /* Set the default configuration */
    TIM_TimeBaseInitStruct->Period    = 0xFFFF;
    TIM_TimeBaseInitStruct->Prescaler = 0x0000;
    TIM_TimeBaseInitStruct->ClkDiv    = TIM_CLK_DIV1;
    TIM_TimeBaseInitStruct->CntMode   = TIM_CNT_MODE_UP;
    TIM_TimeBaseInitStruct->RepetCnt  = 0x0000;

    TIM_TimeBaseInitStruct->CapCh1Sel    = false;
    TIM_TimeBaseInitStruct->CapEtrClrFromCompEn = false;    
}
/**
*\*\name    TIM_Base_Count_Set.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\param   count:
*\*\return  none
**/
void TIM_Base_Count_Set(TIM_Module* TIMx, uint16_t count)
{
    TIMx->CNT= count;
}
/**
*\*\name    TIM_Base_Count_Get.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\return  the value of count register
**/
uint16_t TIM_Base_Count_Get(TIM_Module* TIMx)
{
    /* Get the value of count register */
    return TIMx->CNT;
}

/**
*\*\name    TIM_Auto_Reload_Get.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\return  the value of auto reload register
**/
uint16_t TIM_Auto_Reload_Get(TIM_Module* TIMx)
{
    /* Get the value of auto reload register */
    return TIMx->AR;
}

/**
*\*\name    TIM_Base_Prescaler_Get.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\return  the value of prescaler register
**/
uint16_t TIM_Base_Prescaler_Get(TIM_Module* TIMx)
{
    /* Get the value of prescaler register */
    return TIMx->PSC;
}


/**
*\*\name    TIM_On.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\return  none
**/
void TIM_On(TIM_Module* TIMx)
{
    TIMx->CTRL1 |= TIM_ON;
}

/**
*\*\name    TIM_Off.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\return  none
**/
void TIM_Off(TIM_Module* TIMx)
{
    TIMx->CTRL1 &= (uint32_t)(~((uint32_t)TIM_ON));
}

/**
*\*\name    TIM_Output_Channel1_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel1_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD1;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC1_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feat_value |= (uint16_t)TIM_output_channel_preload;*/
    temp_value |= TIM_output_channel_preload;
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD1 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel2_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel2_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD1;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC2_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |= (uint16_t)(TIM_output_channel_preload << 8);
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD1 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel3_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel3_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD2;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC3_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |= TIM_output_channel_preload;
    /* Write to TIMx CCMOD2 register */
    TIMx->CCMOD2 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel4_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel4_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD2;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC4_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |= (uint16_t)(TIM_output_channel_preload << 8);
    /* Write to TIMx CCMOD2 register */
    TIMx->CCMOD2 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel5_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel5_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD3;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC5_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |= TIM_output_channel_preload;
    /* Write to TIMx CCMOD3 register */
    TIMx->CCMOD3 = temp_value;    
}


/**
*\*\name    TIM_Auto_Reload_Preload_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\return  none
**/
void TIM_Auto_Reload_Preload_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL1 |= TIM_AR_PRELOAD_ENABLE;
}

/**
*\*\name    TIM_Auto_Reload_Preload_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\return  none
**/
void TIM_Auto_Reload_Preload_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL1 &= (uint32_t) ~((uint32_t)TIM_AR_PRELOAD_ENABLE);
}


/**
*\*\name    TIM_Update_Event_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\return  none
**/
void TIM_Update_Event_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL1 &= (uint32_t) ~((uint32_t)TIM_UPDATE_EVENT_DISABLE);
}

/**
*\*\name    TIM_Update_Event_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\return  none
**/
void TIM_Update_Event_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL1 |= TIM_UPDATE_EVENT_DISABLE;
}

/**
*\*\name    TIM_Update_Request_Source_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\param   TIM_update_source:
*\*\          - TIM_UPDATE_SRC_REGULAR    Source of update is counter overflow/underflow
*\*\          - TIM_UPDATE_SRC_GLOBAL     Source of update is the counter overflow/underflow
*\*\                                      or the setting of UG bit, or an update generation
*\*\                                      through the slave mode controller.
*\*\note    TIM6 does note support slave mode and underflow counter
*\*\return  none
**/
void TIM_Update_Request_Source_Set(TIM_Module* TIMx, uint16_t TIM_update_source)
{
    if (TIM_update_source != TIM_UPDATE_SRC_GLOBAL)
    {
        /* Set the URS Bit */
        TIMx->CTRL1 |= TIM_UPRS_REGULAR;
    }
    else
    {
        /* Reset the URS Bit */
        TIMx->CTRL1 &= (uint32_t) ~((uint32_t)TIM_UPRS_REGULAR);
    }
}

/**
*\*\name    TIM_Event_Generate
*\*\fun     Enables or disables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM6
*\*\param   TIM_event_source 
*\*\          - TIM_EVT_SRC_UPDATE    Timer update Event source
*\*\          - TIM_EVT_SRC_CC1       Timer Capture Compare 1 Event source
*\*\          - TIM_EVT_SRC_CC2       Timer Capture Compare 2 Event source
*\*\          - TIM_EVT_SRC_CC3       Timer Capture Compare 3 Event source
*\*\          - TIM_EVT_SRC_CC4       Timer Capture Compare 4 Event source
*\*\          - TIM_EVT_SRC_COM       Timer COM event source
*\*\          - TIM_EVT_SRC_TRIG      Timer Trigger Event source
*\*\          - TIM_EVT_SRC_BREAK     Timer Break event source
*\*\return  none
*\*\note    TIM6 can only generate an update event. 
*\*\        TIM_EVT_SRC_CC3,TIM_EVT_SRC_CC4,TIM_EVT_SRC_COM and TIM_EVT_SRC_BREAK are used only with TIM1.
**/
void TIM_Event_Generate(TIM_Module* TIMx, uint16_t TIM_event_source)
{
    TIMx->EVTGEN = TIM_event_source;
}

/**
*\*\name    TIM_Commutation_Event_Enable
*\*\fun     Enables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_Commutation_Event_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_CCUSEL_COM_AND_TRIG;
}

/**
*\*\name    TIM_Commutation_Event_Disable
*\*\fun     Disables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_Commutation_Event_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t) ~((uint32_t)TIM_CCUSEL_MASK);
}

/**
*\*\name    TIM_Capture_Compare_Control_Preload_Enable
*\*\fun     Disables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
**/
void TIM_Capture_Compare_Control_Preload_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_CCPCTL_PRELOAD;
}

/**
*\*\name    TIM_Capture_Compare_Control_Preload_Disable
*\*\fun     Disables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
**/
void TIM_Capture_Compare_Control_Preload_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t) ~((uint32_t)TIM_CCPCTL_PRELOAD);
}

/**
*\*\name    TIM_Compare1_Set
*\*\fun     Sets the TIMx Capture compare1 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   compare1:
*\*\          - [0,0xffff]
**/
void TIM_Compare1_Set(TIM_Module* TIMx, uint16_t compare1)
{
    TIMx->CCDAT1 = compare1;
}

/**
*\*\name    TIM_Compare2_Set
*\*\fun     Sets the TIMx Capture compare2 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   compare2:
*\*\          - [0,0xffff]
**/
void TIM_Compare2_Set(TIM_Module* TIMx, uint16_t compare2)
{
    TIMx->CCDAT2 = compare2;
}

/**
*\*\name    TIM_Compare3_Set
*\*\fun     Sets the TIMx Capture compare3 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   compare3:
*\*\          - [0,0xffff]
**/
void TIM_Compare3_Set(TIM_Module* TIMx, uint16_t compare3)
{
    TIMx->CCDAT3 = compare3;
}

/**
*\*\name    TIM_Compare4_Set
*\*\fun     Sets the TIMx Capture compare4 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   compare4:
*\*\          - [0,0xffff]
**/
void TIM_Compare4_Set(TIM_Module* TIMx, uint16_t compare4)
{

    TIMx->CCDAT4 = compare4;
}

/**
*\*\name    TIM_Compare5_Set
*\*\fun     Sets the TIMx Capture compare5 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   compare5:
*\*\          - [0,0xffff]
**/
void TIM_Compare5_Set(TIM_Module* TIMx, uint16_t compare5)
{
    TIMx->CCDAT5 = compare5;  
}


/**
*\*\name    TIM_Compare_Capture1_Get 
*\*\fun     Get the TIMx compare1 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture1_Get(TIM_Module* TIMx)
{
    return (uint16_t)(TIMx->CCDAT1);
}

/**
*\*\name    TIM_Compare_Capture2_Get 
*\*\fun     Get the TIMx Compare2 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture2_Get(TIM_Module* TIMx)
{
    return (uint16_t)(TIMx->CCDAT2);
}

/**
*\*\name    TIM_Compare_Capture3_Get 
*\*\fun     Get the TIMx Compare3 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture3_Get(TIM_Module* TIMx)
{
    return (uint16_t)(TIMx->CCDAT3);
}

/**
*\*\name    TIM_Compare_Capture4_Get 
*\*\fun     Get the TIMx Compare4 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture4_Get(TIM_Module* TIMx)
{
    return (uint16_t)(TIMx->CCDAT4);
}

/**
*\*\name    TIM_Compare_Capture5_Get 
*\*\fun     Get the TIMx Compare5 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture5_Get(TIM_Module* TIMx)
{
    return TIMx->CCDAT5;
}



/**
*\*\name    TIM_Trigger_Source_Select
*\*\fun     Selects the Input Trigger source
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_trigger_source
*\*\          - TIM_TRIG_SEL_IN_TR0     Internal Trigger 0
*\*\          - TIM_TRIG_SEL_IN_TR1     Internal Trigger 1
*\*\          - TIM_TRIG_SEL_IN_TR2     Internal Trigger 2
*\*\          - TIM_TRIG_SEL_IN_TR3     Internal Trigger 3
*\*\          - TIM_TRIG_SEL_TI1F_ED    TI1 Edge Detector
*\*\          - TIM_TRIG_SEL_TI1FP1     Filtered Timer Input 1
*\*\          - TIM_TRIG_SEL_TI2FP2     Filtered Timer Input 2
*\*\          - TIM_TRIG_SEL_ETRF       External Trigger input
*\*\return  none
**/
void TIM_Trigger_Source_Select(TIM_Module* TIMx, uint16_t TIM_trigger_source)
{
    uint16_t temp_value = 0;

    /* Get the TIMx SMCTRL register value */
    temp_value = TIMx->SMCTRL;
    /* Reset the TS Bits */
    temp_value &= (uint16_t)(~((uint16_t)TIM_TRIG_SEL_MASK));
    /* Set the Input Trigger source */
    temp_value |= TIM_trigger_source;
    /* Write to TIMx SMCTRL */
    TIMx->SMCTRL = temp_value;
}


/**
*\*\name    Input_Channel1_Config
*\*\fun     Configure the TI1 as Input.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   input_channel_polarity The Input Polarity.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   input_channel_selection specifies the input to be used.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_SELECTION_DIRECTTI      TIM Input 1 is selected to be connected to IC1.
*\*\          - TIM_IC_SELECTION_INDIRECTTI    TIM Input 1 is selected to be connected to IC2.
*\*\          - TIM_IC_SELECTION_TRC           TIM Input 1 is selected to be connected to TRC.
*\*\param   input_channel_filter Specifies the Input Capture Filter.
*\*\            [0x00 0xF]
*\*\return  none
**/
void Input_Channel1_Config(TIM_Module* TIMx, uint16_t input_channel_polarity, 
                               uint16_t input_channel_selection, uint16_t input_channel_filter)
{
    uint16_t temp_ccmod1 = 0;
    uint32_t temp_ccen  = 0;
    /* Disable the Channel 1: Reset the CC1E Bit */
    TIMx->CCEN &= (uint32_t) ~((uint32_t)TIM_CC1EN);
    temp_ccmod1 = TIMx->CCMOD1;
    temp_ccen  = TIMx->CCEN;
    /* Select the Input and set the filter */
    temp_ccmod1 &= (uint16_t)(((uint16_t) ~((uint16_t)TIM_IC1_SELECTION_MASK)) & ((uint16_t) ~((uint16_t)TIM_IC1_FILTER_MASK)));
    temp_ccmod1 |= (uint16_t)(input_channel_selection | (uint16_t)(input_channel_filter << (uint16_t)4));

    if ((TIMx == TIM1) || (TIMx == TIM3))
    {
        /* Select the Polarity and set the CC1E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC1P));
        temp_ccen |= (uint32_t)(input_channel_polarity | (uint32_t)TIM_CC1EN);
    }
    else
    {
        /* Select the Polarity and set the CC1E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC1P | TIM_CC1NP));
        temp_ccen |= (uint32_t)(input_channel_polarity | (uint32_t)TIM_CC1EN);
    }

    /* Write to TIMx CCMOD1 and CCEN registers */
    TIMx->CCMOD1 = temp_ccmod1;
    TIMx->CCEN   = temp_ccen;
}

/**
*\*\name    Input_Channel2_Config
*\*\fun     Configure the TI2 as Input.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   input_channel_polarity The Input Polarity.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   input_channel_selection specifies the input to be used.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_SELECTION_DIRECTTI      TIM Input 2 is selected to be connected to IC2.
*\*\          - TIM_IC_SELECTION_INDIRECTTI    TIM Input 2 is selected to be connected to IC1.
*\*\          - TIM_IC_SELECTION_TRC           TIM Input 2 is selected to be connected to TRC.
*\*\param   input_channel_filter Specifies the Input Capture Filter.
*\*\            [0x00 0x0F]
*\*\return  none
**/
void Input_Channel2_Config(TIM_Module* TIMx, uint16_t input_channel_polarity, 
                           uint16_t input_channel_selection, uint16_t input_channel_filter)
{
    uint16_t temp_ccmod1 = 0;
    uint32_t temp_ccen = 0, temp_value = 0;
    /* Disable the Channel 2: Reset the CC2E Bit */
    TIMx->CCEN &= (uint32_t) ~((uint32_t)TIM_CC2EN);
    temp_ccmod1 = TIMx->CCMOD1;
    temp_ccen = TIMx->CCEN;
    temp_value = (uint32_t)(input_channel_polarity << 4);
    /* Select the Input and set the filter */
    temp_ccmod1 &= (uint16_t)(((uint16_t) ~((uint16_t)TIM_IC2_SELECTION_MASK)) & ((uint16_t) ~((uint16_t)TIM_IC2_FILTER_MASK)));
    temp_ccmod1 |= (uint16_t)(input_channel_filter << 12);
    temp_ccmod1 |= (uint16_t)(input_channel_selection << 8);

    if ((TIMx == TIM1) || (TIMx == TIM3))
    {
        /* Select the Polarity and set the CC2E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC2P));
        temp_ccen |= (uint32_t)(temp_value | (uint32_t)TIM_CC2EN);
    }
    else
    {
        /* Select the Polarity and set the CC2E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC2P | TIM_CC2NP));
        temp_ccen |= (uint32_t)(input_channel_polarity | (uint32_t)TIM_CC2EN);
    }

    /* Write to TIMx CCMOD1 and CCEN registers */
    TIMx->CCMOD1 = temp_ccmod1;
    TIMx->CCEN   = temp_ccen;
}


/**
*\*\name    Input_Channel3_Config
*\*\fun     Configure the TI3 as Input.
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   input_channel_polarity The Input Polarity.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   input_channel_selection specifies the input to be used.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_SELECTION_DIRECTTI      TIM Input 3 is selected to be connected to IC3.
*\*\          - TIM_IC_SELECTION_INDIRECTTI    TIM Input 3 is selected to be connected to IC4.
*\*\          - TIM_IC_SELECTION_TRC           TIM Input 3 is selected to be connected to TRC.
*\*\param   input_channel_filter Specifies the Input Capture Filter.
*\*\            [0x00 0x0F]
*\*\return  none
**/
void Input_Channel3_Config(TIM_Module* TIMx, uint16_t input_channel_polarity, 
                           uint16_t input_channel_selection, uint16_t input_channel_filter)
{
    uint16_t temp_ccmod2 = 0;
    uint32_t temp_ccen = 0, temp_value = 0;
    /* Disable the Channel 3: Reset the CC3E Bit */
    TIMx->CCEN &= (uint32_t) ~((uint32_t)TIM_CC3EN);
    temp_ccmod2 = TIMx->CCMOD2;
    temp_ccen = TIMx->CCEN;
    temp_value = (uint32_t)(input_channel_polarity << 8);
    /* Select the Input and set the filter */
    temp_ccmod2 &= (uint16_t)(((uint16_t) ~((uint16_t)TIM_IC3_SELECTION_MASK)) & ((uint16_t) ~((uint16_t)TIM_IC3_FILTER_MASK)));
    temp_ccmod2 |= (uint16_t)(input_channel_selection | (uint16_t)(input_channel_filter << (uint16_t)4));

    if (TIMx == TIM1)
    {
        /* Select the Polarity and set the CC3E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC3P));
        temp_ccen |= (uint32_t)(temp_value | (uint32_t)TIM_CC3EN);
    }
    else
    {
        /* Select the Polarity and set the CC3E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC3P | TIM_CC3NP));
        temp_ccen |= (uint32_t)(input_channel_polarity | (uint32_t)TIM_CC3EN);
    }

    /* Write to TIMx CCMOD2 and CCEN registers */
    TIMx->CCMOD2 = temp_ccmod2;
    TIMx->CCEN   = temp_ccen;
}

/**
*\*\name    Input_Channel4_Config
*\*\fun     Configure the TI4 as Inputt.
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   input_channel_polarity The Input Polarity.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   input_channel_selection specifies the input to be used.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_SELECTION_DIRECTTI      TIM Input 4 is selected to be connected to IC4.
*\*\          - TIM_IC_SELECTION_INDIRECTTI    TIM Input 4 is selected to be connected to IC3.
*\*\          - TIM_IC_SELECTION_TRC           TIM Input 4 is selected to be connected to TRC.
*\*\param   input_channel_filter Specifies the Input Capture Filter.
*\*\            [0x00 0x0F]
*\*\return  none
**/
void Input_Channel4_Config(TIM_Module* TIMx, uint16_t input_channel_polarity, 
                           uint16_t input_channel_selection, uint16_t input_channel_filter)
{
    uint16_t temp_ccmod2 = 0;
    uint32_t temp_ccen = 0, temp_value = 0;

    /* Disable the Channel 4: Reset the CC4E Bit */
    TIMx->CCEN &= (uint32_t) ~((uint32_t)TIM_CC4EN);
    temp_ccmod2 = TIMx->CCMOD2;
    temp_ccen = TIMx->CCEN;
    temp_value = (uint32_t)(input_channel_polarity << 12);
    /* Select the Input and set the filter */
    temp_ccmod2 &= (uint16_t)((uint16_t)(~(uint16_t)TIM_IC4_SELECTION_MASK) & ((uint16_t) ~((uint16_t)TIM_IC4_FILTER_MASK)));
    temp_ccmod2 |= (uint16_t)(input_channel_selection << 8);
    temp_ccmod2 |= (uint16_t)(input_channel_filter << 12);

    if (TIMx == TIM1)
    {
        /* Select the Polarity and set the CC4E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC4P));
        temp_ccen |= (uint32_t)(temp_value | (uint32_t)TIM_CC4EN);
    }
    else
    {
        /* Select the Polarity and set the CC4E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC4P));
        temp_ccen |= (uint32_t)(input_channel_polarity | (uint32_t)TIM_CC4EN);
    }
    /* Write to TIMx CCMOD2 and CCEN registers */
    TIMx->CCMOD2 = temp_ccmod2;
    TIMx->CCEN   = temp_ccen;
}

/**
*\*\name    TIM_External_Trigger_Filter_Set
*\*\fun     Configures the filter of TIMx External Trigger.
*\*\param   TIMx 
*\*\          - TIM1
*\*\          - TIM3
*\*\param   external_trigger_filter 
*\*\          - [0x0,0xF]
*\*\return  none
**/
void TIM_External_Trigger_Filter_Set(TIM_Module* TIMx,
                                     uint16_t external_trigger_filter)
{
    /* Reset the ETRPSC Bits */
    uint16_t temp_value = TIMx->SMCTRL;
    temp_value &= (uint16_t)(~((uint16_t)TIM_EXT_TRIG_FILTER_MASK));
    /* Set the Prescaler, the Filter value and the Polarity */
    temp_value |= (uint16_t)(external_trigger_filter << (uint16_t)8);
    TIMx->SMCTRL = temp_value;
}


/**
*\*\name    TIM_External_Trigger_Prescaler_Set
*\*\fun     Configures the prescaler of  External Trigger (ETR).
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   external_trigger_prescaler 
*\*\          - TIM_EXT_TRG_PSC_OFF ETRP Prescaler OFF.
*\*\          - TIM_EXT_TRG_PSC_DIV2 ETRP frequency divided by 2.
*\*\          - TIM_EXT_TRG_PSC_DIV4 ETRP frequency divided by 4.
*\*\          - TIM_EXT_TRG_PSC_DIV8 ETRP frequency divided by 8.
*\*\return  - none
**/
void TIM_External_Trigger_Prescaler_Set(TIM_Module* TIMx,
                                        uint16_t external_trigger_prescaler)
{
    /* Reset the ETRPSC Bits */
    uint16_t temp_value = TIMx->SMCTRL;
    temp_value &= (uint16_t)(~((uint16_t)TIM_EXT_TRG_PSC_MASK));
    /* Set the Prescaler, the Filter value and the Polarity */
    temp_value |= (uint16_t)(external_trigger_prescaler);
    TIMx->SMCTRL = temp_value;
}

