ljgabc/rtthread/bsp/n32g003/library/n32g003_tim.c
    /* Write to TIMx CCEN register */
    TIMx->CCEN = temp_value;
}

/**
*\*\name    TIM_Output_Channel_N_Polarity_Set.
*\*\fun     set the mode of polarity of TIMx channel
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   output_channel_N_polarity:
**\           - TIM_OCN_POLARITY_LOW
**\           - TIM_OCN_POLARITY_HIGH
*\*\param   channel:
**\           - TIM_CH_1
**\           - TIM_CH_2
**\           - TIM_CH_3
*\*\return  none
*\*\note    This function is only for TIM1 
**/
void TIM_Output_Channel_N_Polarity_Set(TIM_Module* TIMx, uint32_t output_channel_N_polarity, uint16_t channel)
{
    uint32_t temp_value = TIMx->CCEN;
    /* Clear the CCxEN bit */
    temp_value &= (uint32_t)(~(uint32_t)(TIM_OCN_POLARITY_MASK << channel));

    /* Set the CCxEN bit */
    temp_value |= (uint32_t)(output_channel_N_polarity << channel);

    TIMx->CCEN = temp_value;
}

/**
*\*\name    TIM_Capture_Compare_Ch_Enable.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   channel:
**\           - TIM_CH_1
**\           - TIM_CH_2
**\           - TIM_CH_3
**\           - TIM_CH_4
**\           - TIM_CH_5
*\*\return  none
*\*\note    - TIM3 does not support channel 6,channel 5,channel 4 and channel 3
**/
void TIM_Capture_Compare_Ch_Enable(TIM_Module* TIMx, uint16_t channel)
{
    TIMx->CCEN |= (uint32_t)(TIM_CAP_CMP_ENABLE << channel);
}

/**
*\*\name    TIM_Capture_Compare_Ch_Disable.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   channel:
**\           - TIM_CH_1
**\           - TIM_CH_2
**\           - TIM_CH_3
**\           - TIM_CH_4
**\           - TIM_CH_5
*\*\return  none
*\*\note    - TIM3 does not support channel 6,channel 5,channel 4 and channel 3
**/
void TIM_Capture_Compare_Ch_Disable(TIM_Module* TIMx, uint16_t channel)
{
    TIMx->CCEN &= (uint32_t)(~(TIM_CAP_CMP_ENABLE << channel));
}

/**
*\*\name    TIM_Capture_Compare_Ch_N_Enable.
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   channel:
**\           - TIM_CH_1
**\           - TIM_CH_2
**\           - TIM_CH_3
*\*\return  none
**/
void TIM_Capture_Compare_Ch_N_Enable(TIM_Module* TIMx, uint16_t channel)
{
    TIMx->CCEN |= (uint32_t)(TIM_CAP_CMP_N_ENABLE << channel);
}

/**
*\*\name    TIM_Capture_Compare_Ch_N_Disable.
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   channel:
**\           - TIM_CH_1
**\           - TIM_CH_2
**\           - TIM_CH_3
*\*\return  none
**/
void TIM_Capture_Compare_Ch_N_Disable(TIM_Module* TIMx, uint16_t channel)
{
    TIMx->CCEN &= (uint32_t)(~(TIM_CAP_CMP_N_ENABLE << channel));
}

/**
*\*\name    TIM_CCEN_Status_Get
*\*\fun     Checks whether the specified TIM flag is set or not.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_CCEN:
*\*\          - TIM_CC1EN Bit
*\*\          - TIM_CC1NEN Bit
*\*\          - TIM_CC2EN Bit
*\*\          - TIM_CC2NEN Bit
*\*\          - TIM_CC3EN Bit
*\*\          - TIM_CC3NEN Bit
*\*\          - TIM_CC4EN Bit
*\*\          - TIM_CC5EN Bit
*\*\return:
*\*\          - SET
*\*\          - RESET
*\*\note：
*\*\          - TIM_CC1NEN TIM_CC2NEN TIM_CC3EN TIM_CC3NEN TIM_CC4EN TIM_CC5EN is used only with TIM1.
**/
FlagStatus TIM_CCEN_Status_Get(TIM_Module* TIMx, uint32_t TIM_CCEN)
{
    if ((TIMx->CCEN & TIM_CCEN) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
*\*\name    TIM_Output_Channel_Mode_Set.
*\*\fun     set the mode of output channel of TIMx
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   output_channel_mode:
*\*\          - TIM_OCMODE_TIMING
*\*\          - TIM_OCMODE_ACTIVE
*\*\          - TIM_OCMODE_TOGGLE
*\*\          - TIM_OCMODE_PWM1
*\*\          - TIM_OCMODE_PWM2
*\*\          - TIM_FORCED_ACTION_ACTIVE
*\*\          - TIM_FORCED_ACTION_INACTIVE
*\*\param   channel:
**\           - For TIM1:
**\             - TIM_CH_1
**\             - TIM_CH_2
**\             - TIM_CH_3
**\             - TIM_CH_4
**\           - For TIM3:
**\             - TIM_CH_1
**\             - TIM_CH_2
*\*\return  none
*\*\note    - This function disables the selected channel before changing the Output Compare Mode.
*\*\           User has to enable this channel using TIM_Capture_Compare_Ch_Enable,TIM_Capture_Compare_Ch_N_Enable functions.
**/
void TIM_Output_Channel_Mode_Set(TIM_Module* TIMx, uint32_t output_channel_mode, uint16_t channel)
{
    uint32_t temp  = 0;
    uint16_t temp1 = 0;

    temp = (uint32_t)TIMx;
    temp += CAPCMPMOD_OFFSET;

    temp1 = CAPCMPEN_CCE_SET << (uint16_t)channel;

    /* Disable the channel: Reset the CCxE Bit */
    TIMx->CCEN &= (uint16_t)~temp1;

    if ((channel == TIM_CH_1) || (channel == TIM_CH_3))
    {
        temp += (channel >> 1);

        /* Reset the OCxM bits in the CCMRx register */
        *(__IO uint32_t*)temp &= (uint32_t) ~((uint32_t)TIM_OC1MODE_MASK);

        /* Configure the OCxM bits in the CCMRx register */
        *(__IO uint32_t*)temp |= output_channel_mode;
    }
    else
    {
        temp += (uint16_t)(channel - (uint16_t)4) >> (uint16_t)1;

        /* Reset the OCxM bits in the CCMRx register */
        *(__IO uint32_t*)temp &= (uint32_t) ~((uint32_t)TIM_OC2MODE_MASK);

        /* Configure the OCxM bits in the CCMRx register */
        *(__IO uint32_t*)temp |= (uint16_t)(output_channel_mode << 8);
    }
}

/**
*\*\name    TIM_Forced_Output_Channel1_Set.
*\*\fun     set the mode of output channel of TIMx
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_forced_action:
*\*\          - TIM_FORCED_ACTION_ACTIVE Force active level on OC1REF
*\*\          - TIM_FORCED_ACTION_INACTIVE Force inactive level on OC1REF.
*\*\return  none
**/
void TIM_Forced_Output_Channel1_Set(TIM_Module* TIMx, uint16_t TIM_forced_action)
{
    uint16_t temp_value = 0;
    /* Check the parameters */
    temp_value = TIMx->CCMOD1;
    /* Reset the OC1M Bits */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC1MODE_MASK);
    /* Configure The Forced output Mode */
    temp_value |= TIM_forced_action;
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD1 = temp_value;    
}

/**
*\*\name    TIM_Output_Channe2_Mode_Set.
*\*\fun     set the mode of output channe2 of TIMx
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_forced_action:
*\*\          - TIM_FORCED_ACTION_ACTIVE Force active level on OC2REF
*\*\          - TIM_FORCED_ACTION_INACTIVE Force inactive level on OC2REF.
*\*\return  none
**/
void TIM_Forced_Output_Channel2_Set(TIM_Module* TIMx, uint16_t TIM_forced_action)
{
    uint16_t temp_value = 0;
    /* Check the parameters */
    temp_value = TIMx->CCMOD1;
    /* Reset the OC1M Bits */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC2MODE_MASK);
    /* Configure The Forced output Mode */
    temp_value |= (uint16_t)(TIM_forced_action << 8);
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD1 = temp_value;    
}

/**
*\*\name    TIM_Output_Channe3_Mode_Set.
*\*\fun     set the mode of output channe3 of TIMx
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_forced_action:
*\*\          - TIM_FORCED_ACTION_ACTIVE Force active level on OC3REF
*\*\          - TIM_FORCED_ACTION_INACTIVE Force inactive level on OC3REF.
*\*\return  none
**/
void TIM_Forced_Output_Channel3_Set(TIM_Module* TIMx, uint16_t TIM_forced_action)
{
    uint16_t temp_value = 0;
    /* Check the parameters */
    temp_value = TIMx->CCMOD2;
    /* Reset the OC1M Bits */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC3MODE_MASK);
    /* Configure The Forced output Mode */
    temp_value |= TIM_forced_action;
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD2 = temp_value;    
}

/**
*\*\name    TIM_Output_Channe4_Mode_Set.
*\*\fun     set the mode of output channe4 of TIMx
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_forced_action:
*\*\          - TIM_FORCED_ACTION_ACTIVE Force active level on OC4REF
*\*\          - TIM_FORCED_ACTION_INACTIVE Force inactive level on OC4REF.
*\*\return  none
**/
void TIM_Forced_Output_Channel4_Set(TIM_Module* TIMx, uint16_t TIM_forced_action)
{
    uint16_t temp_value = 0;
    /* Check the parameters */
    temp_value = TIMx->CCMOD2;
    /* Reset the OC1M Bits */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC4MODE_MASK);
    /* Configure The Forced output Mode */
    temp_value |= (uint16_t)(TIM_forced_action << 8);
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD2 = temp_value;    
}

/**
*\*\name    TIM_Output_Channe5_Mode_Set.
*\*\fun     set the mode of output channe5 of TIMx
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_forced_action:
*\*\          - TIM_FORCED_ACTION_ACTIVE Force active level on OC5REF
*\*\          - TIM_FORCED_ACTION_INACTIVE Force inactive level on OC5REF.
*\*\return  none
**/
void TIM_Forced_Output_Channel5_Set(TIM_Module* TIMx, uint16_t TIM_forced_action)
{
    uint16_t temp_value = 0;
    /* Check the parameters */
    temp_value = TIMx->CCMOD3;
    /* Reset the OC1M Bits */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC5MODE_MASK);
    /* Configure The Forced output Mode */
    temp_value |= TIM_forced_action;
    /* Write to TIMx CCMOD3 register */
    TIMx->CCMOD3 = temp_value;    
}


/**
*\*\name    TIM_Output_Channel1_Fast_Set
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_output_channel_fast:
*\*\          - TIM_OC_FAST_ENABLE TIM Output fast enable
*\*\          - TIM_OC_FAST_DISABLE TIM Output fast disable
*\*\return  none
**/
void TIM_Output_Channel1_Fast_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_fast)
{
    uint16_t temp_value = 0;
    /* Get the TIMx CCMOD1 register value */
    temp_value = TIMx->CCMOD1;
    /* Reset the OC1FE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC_FAST_ENABLE);
    /* Enable or Disable the Output Compare Fast Bit */
    temp_value |= TIM_output_channel_fast;
    /* Write to TIMx CCMOD1 */
    TIMx->CCMOD1 = temp_value;
}

/**
*\*\name    TIM_Output_Channel2_Fast_Set
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_output_channel_fast:
*\*\          - TIM_OC_FAST_ENABLE TIM Output fast enable
*\*\          - TIM_OC_FAST_DISABLE TIM Output fast disable
*\*\return  none
**/
void TIM_Output_Channel2_Fast_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_fast)
{
    uint16_t temp_value = 0;
    /* Get the TIMx CCMOD1 register value */
    temp_value = TIMx->CCMOD1;
    /* Reset the OC1FE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_CCMOD1_OC2FEN);
    /* Enable or Disable the Output Compare Fast Bit */
    temp_value |= (uint16_t)(TIM_output_channel_fast << 8);
    /* Write to TIMx CCMOD1 */
    TIMx->CCMOD1 = temp_value;
}

/**
*\*\name    TIM_Output_Channel3_Fast_Set
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_fast:
*\*\          - TIM_OC_FAST_ENABLE TIM Output fast enable
*\*\          - TIM_OC_FAST_DISABLE TIM Output fast disable
*\*\return  none
**/
void TIM_Output_Channel3_Fast_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_fast)
{
    uint16_t temp_value = 0;
    /* Get the TIMx CCMOD1 register value */
    temp_value = TIMx->CCMOD2;
    /* Reset the OC1FE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_CCMOD2_OC3FEN);
    /* Enable or Disable the Output Compare Fast Bit */
    temp_value |= TIM_output_channel_fast;
    /* Write to TIMx CCMOD2 */
    TIMx->CCMOD2 = temp_value;
}

/**
*\*\name    TIM_Output_Channel4_Fast_Set
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_fast:
*\*\          - TIM_OC_FAST_ENABLE TIM Output fast enable
*\*\          - TIM_OC_FAST_DISABLE TIM Output fast disable
*\*\return  none
**/
void TIM_Output_Channel4_Fast_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_fast)
{
    uint16_t temp_value = 0;
    /* Get the TIMx CCMOD1 register value */
    temp_value = TIMx->CCMOD2;
    /* Reset the OC1FE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_CCMOD2_OC4FEN);
    /* Enable or Disable the Output Compare Fast Bit */
    temp_value |= (uint16_t)(TIM_output_channel_fast << 8);
    /* Write to TIMx CCMOD2 */
    TIMx->CCMOD2 = temp_value;
}

/**
*\*\name    TIM_Output_Channel5_Fast_Set
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_fast:
*\*\          - TIM_OC_FAST_ENABLE TIM Output fast enable
*\*\          - TIM_OC_FAST_DISABLE TIM Output fast disable
*\*\return  none
**/
void TIM_Output_Channel5_Fast_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_fast)
{
    uint16_t temp_value = 0;
    /* Get the TIMx CCMOD1 register value */
    temp_value = TIMx->CCMOD3;
    /* Reset the OC1FE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_CCMOD3_OC5FEN);
    /* Enable or Disable the Output Compare Fast Bit */
    temp_value |= TIM_output_channel_fast;
    /* Write to TIMx CCMOD3 */
    TIMx->CCMOD3 = temp_value;
}


/**
*\*\name    TIM_Output_Channel1_Reference_Clear
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_output_channel_clear:
*\*\          - TIM_OC_CLEAR_ENABLE TIM Output clear enable
*\*\          - TIM_OC_CLEAR_DISABLE TIM Output clear disable
*\*\return  none
**/
void TIM_Output_Channel1_Reference_Clear(TIM_Module* TIMx, uint16_t TIM_output_channel_clear)
{
    uint16_t temp_value = 0;
    /* Check the parameters */

    temp_value = TIMx->CCMOD1;

    /* Reset the OC1CE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC1_CLEAR_MASK);
    /* Enable or Disable the Output Compare Clear Bit */
    temp_value |= TIM_output_channel_clear;
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD1 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel2_Reference_Clear
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_output_channel_clear:
*\*\          - TIM_OC_CLEAR_ENABLE TIM Output clear enable
*\*\          - TIM_OC_CLEAR_DISABLE TIM Output clear disable
*\*\return  none
**/
void TIM_Output_Channel2_Reference_Clear(TIM_Module* TIMx, uint16_t TIM_output_channel_clear)
{
    uint16_t temp_value = 0;
    /* Check the parameters */

    temp_value = TIMx->CCMOD1;

    /* Reset the OC1CE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC2_CLEAR_MASK);
    /* Enable or Disable the Output Compare Clear Bit */
    temp_value |= (uint16_t)(TIM_output_channel_clear << 8);
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD1 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel3_Reference_Clear
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_clear:
*\*\          - TIM_OC_CLEAR_ENABLE TIM Output clear enable
*\*\          - TIM_OC_CLEAR_DISABLE TIM Output clear disable
*\*\return  none
**/
void TIM_Output_Channel3_Reference_Clear(TIM_Module* TIMx, uint16_t TIM_output_channel_clear)
{
    uint16_t temp_value = 0;
    /* Check the parameters */

    temp_value = TIMx->CCMOD2;

    /* Reset the OC1CE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC3_CLEAR_MASK);
    /* Enable or Disable the Output Compare Clear Bit */
    temp_value |= TIM_output_channel_clear;
    /* Write to TIMx CCMOD2 register */
    TIMx->CCMOD2 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel4_Reference_Clear
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_clear:
*\*\          - TIM_OC_CLEAR_ENABLE TIM Output clear enable
*\*\          - TIM_OC_CLEAR_DISABLE TIM Output clear disable
*\*\return  none
**/
void TIM_Output_Channel4_Reference_Clear(TIM_Module* TIMx, uint16_t TIM_output_channel_clear)
{
    uint16_t temp_value = 0;
    /* Check the parameters */

    temp_value = TIMx->CCMOD2;

    /* Reset the OC1CE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC4_CLEAR_MASK);
    /* Enable or Disable the Output Compare Clear Bit */
    temp_value |= (uint16_t)(TIM_output_channel_clear << 8);
    /* Write to TIMx CCMOD2 register */
    TIMx->CCMOD2 = temp_value;    
}
/**
*\*\name    TIM_Output_Channel5_Reference_Clear
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_clear:
*\*\          - TIM_OC_CLEAR_ENABLE TIM Output clear enable
*\*\          - TIM_OC_CLEAR_DISABLE TIM Output clear disable
*\*\return  none
**/
void TIM_Output_Channel5_Reference_Clear(TIM_Module* TIMx, uint16_t TIM_output_channel_clear)
{
    uint16_t temp_value = 0;
    /* Check the parameters */

    temp_value = TIMx->CCMOD3;

    /* Reset the OC1CE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC5_CLEAR_MASK);
    /* Enable or Disable the Output Compare Clear Bit */
    temp_value |= TIM_output_channel_clear;
    /* Write to TIMx CCMOD3 register */
    TIMx->CCMOD3 = temp_value;    
}


/**
*\*\name    TIM_Output_Channel1_Initialize
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_OCInitStruct:
*\*\          - Refer to the definition of OCInitType.
*\*\return  none
**/
void TIM_Output_Channel1_Initialize(TIM_Module* TIMx, OCInitType* TIM_OCInitStruct)
{
    uint16_t temp_value1 = 0;
    uint32_t temp_value2 = 0;

    /* Disable the Channel 1， Reset the CC1EN Bit */
    TIM_Capture_Compare_Ch_Disable(TIMx, TIM_CH_1);

    /* Get the TIMx CTRL2 register value */
    temp_value2 = TIMx->CTRL2;

    /* Get the TIMx CCMOD1 register value */
    temp_value1 = TIMx->CCMOD1;

    /* Reset the Output Compare Mode Bits */
    temp_value1 &= (uint16_t)(~((uint16_t)TIM_OC1MODE_MASK));
    temp_value1 &= (uint16_t)(~((uint16_t)TIM_IC1_SELECTION_MASK));

    /* Select the Output Compare Mode */
    temp_value1 |= TIM_OCInitStruct->OcMode;

    TIM_Output_Channel_Polarity_Set(TIMx, TIM_OCInitStruct->OcPolarity, TIM_CH_1);

    /* Set the Output State */
    if(TIM_OCInitStruct->OutputState)
    {
        TIM_Capture_Compare_Ch_Enable(TIMx, TIM_CH_1);
    }
    else
    {
        TIM_Capture_Compare_Ch_Disable(TIMx, TIM_CH_1);
    }

    if (TIMx == TIM1)
    {
        /* Set the Output N Polarity level */
        TIM_Output_Channel_N_Polarity_Set(TIMx, TIM_OCInitStruct->OcNPolarity, TIM_CH_1);

        /* Set the Output N State */
        if(TIM_OCInitStruct->OutputNState)
        {
            TIM_Capture_Compare_Ch_N_Enable(TIMx, TIM_CH_1);
        }
        else
        {
            TIM_Capture_Compare_Ch_N_Disable(TIMx, TIM_CH_1);
        }

        /* Reset the Output Compare and Output Compare N IDLE State */
        temp_value2 &= (uint32_t)(~((uint32_t)TIM_OC1_IDLE_STATE_MASK));
        temp_value2 &= (uint32_t)(~((uint32_t)TIM_OC1N_IDLE_STATE_MASK));

        /* Set the Output Idle state */
        temp_value2 |= TIM_OCInitStruct->OcIdleState;
        /* Set the Output N Idle state */
        temp_value2 |= TIM_OCInitStruct->OcNIdleState;
    }
    /* Write to TIMx CTRL2 */
    TIMx->CTRL2 = temp_value2;

    /* Write to TIMx CCMOD1 */
    TIMx->CCMOD1 = temp_value1;

    /* Set the Capture Compare Register value */
    TIMx->CCDAT1 = TIM_OCInitStruct->Pulse;
    
